# PDF_ThreadInitialize

## Description
The library needs to be Initialized per thread

```pascal
FUNCTION PDF_ThreadInitialize : BOOLEAN;
```

```python
def vs.PDF_ThreadInitialize():
    return BOOLEAN
```

## Version
Availability: from Vectorworks 2014

## Category
* PDF